In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4], 'col2':[555,666,777,888],'col3':['abc','def','ghi','jkl']})

In [3]:
df.head()

   col1  col2 col3
0     1   555  abc
1     2   666  def
2     3   777  ghi
3     4   888  jkl

In [5]:
df['col2'].nunique()

4

In [11]:
newdf = df[(df['col1']>3)& (df['col2']==888)]

In [12]:
newdf

   col1  col2 col3
3     4   888  jkl

In [13]:
def times2(x):
    return x*2

In [14]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [15]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [17]:
df['col1'].sum()

10

In [18]:
del df['col3']

In [19]:
df

   col1  col2
0     1   555
1     2   666
2     3   777
3     4   888

In [20]:
df.columns

Index(['col1', 'col2'], dtype='object')

In [21]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
df.sort_values(by="col2")

   col1  col2
0     1   555
1     2   666
2     3   777
3     4   888

In [23]:
df.isnull()

    col1   col2
0  False  False
1  False  False
2  False  False
3  False  False

In [24]:
df.dropna()

   col1  col2
0     1   555
1     2   666
2     3   777
3     4   888

In [25]:
import numpy as np

In [28]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                  'col2':[np.nan,555,666,333],
                  'col3':['abc','def','ghi','jkl']})

In [29]:
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  333.0  jkl

In [30]:
df.fillna('Sports')

     col1    col2 col3
0       1  Sports  abc
1       2     555  def
2       3     666  ghi
3  Sports     333  jkl

In [33]:
data = {'A':['ba','na','na','ba','ba','na'],
       'B':['ooh','aah','ooh','aah','ooh','aah'],
       'C':['a','c','d','f','e','b'],
       'D':[1,2,3,4,5,6]}
df = pd.DataFrame(data)

In [34]:
df

    A    B  C  D
0  ba  ooh  a  1
1  na  aah  c  2
2  na  ooh  d  3
3  ba  aah  f  4
4  ba  ooh  e  5
5  na  aah  b  6

In [39]:
df.pivot_table(values=['D'], index=['C'], columns=['A','B'])

     D
A   ba        na
B  aah  ooh  aah  ooh
C
a  NaN  1.0  NaN  NaN
b  NaN  NaN  6.0  NaN
c  NaN  NaN  2.0  NaN
d  NaN  NaN  NaN  3.0
e  NaN  5.0  NaN  NaN
f  4.0  NaN  NaN  NaN